tap "felixkratz/formulae"
tap "homebrew/command-not-found"
tap "libsql/sqld"
tap "macos-fuse-t/cask"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "simonw/llm"
tap "sst/tap"
tap "steveyegge/beads"
tap "tursodatabase/tap"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "openssl@3"
brew "ncurses"
brew "asciiquarium"
brew "asitop"
brew "ast-grep"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bat-extras"
brew "coreutils"
brew "bats-core"
brew "icu4c@77"
brew "node"
brew "bitwarden-cli"
brew "boost"
brew "bottom"
brew "btop"
brew "glib"
brew "cascadia"
brew "cbonsai"
brew "chezmoi"
brew "cmatrix"
brew "cowsay"
brew "cryptography"
brew "datasette"
brew "dialog"
brew "direnv"
brew "duf"
brew "exiftool"
brew "eza"
brew "fabric-ai"
brew "fastfetch"
brew "fd"
brew "unbound"
brew "harfbuzz"
brew "leptonica"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "gitleaks"
brew "glances"
brew "glow"
brew "gnupg"
brew "go"
brew "gollama"
brew "gpgme"
brew "handbrake"
brew "html2text"
brew "htmlq"
brew "htop"
brew "httpd"
brew "httpie"
brew "hugo"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "libraqm"
brew "pillow"
brew "iperf3"
brew "jq"
brew "jrnl"
brew "keychain"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "lefthook"
brew "libxml2"
brew "lolcat"
brew "lynx"
brew "mas"
brew "mole"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "nano"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "python@3.12"
brew "ocrmypdf"
brew "optipng"
brew "pandoc"
brew "pipx"
brew "poppler"
brew "postgresql@18", restart_service: :changed
brew "pyright"
brew "repomix"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "shunit2"
brew "sl"
brew "starship"
brew "tailspin"
brew "telnet"
brew "terminal-notifier"
brew "tesseract-lang"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "transmission-cli"
brew "trash"
brew "tree"
brew "uv"
brew "wget"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"
brew "simonw/llm/ttok"
brew "sst/tap/opencode"
brew "steveyegge/beads/bd"
brew "tursodatabase/tap/turso"
cask "aldente"
cask "alt-tab"
cask "antinote"
cask "anydesk"
cask "appcleaner"
cask "arc"
cask "balenaetcher"
cask "betterzip"
cask "bitwarden"
cask "brave-browser"
cask "caffeine"
cask "calibre"
cask "chatgpt"
cask "codex"
cask "cryptomator"
cask "dropbox"
cask "easyfind"
cask "eqmac"
cask "firefox"
cask "fuse-t"
cask "ghostty"
cask "gitbutler"
cask "google-chrome"
cask "grandperspective"
cask "handbrake-app"
cask "helium-browser"
cask "hookmark"
cask "hyperkey"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "jordanbaird-ice"
cask "keepingyouawake"
cask "keka"
cask "kiwix"
cask "latest"
cask "linearmouse"
cask "lm-studio"
cask "loom"
cask "lulu"
cask "maccy"
cask "macupdater"
cask "makemkv"
cask "meetingbar"
cask "meld"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "moom"
cask "morgen"
cask "multipass"
cask "numi"
cask "obs"
cask "obsidian"
cask "ollama-app"
cask "orion"
cask "oversight"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qobuz"
cask "radio-silence"
cask "rar"
cask "raycast"
cask "responsively"
cask "script-kit"
cask "selfcontrol"
cask "signal"
cask "slack"
cask "spotify"
cask "stats"
cask "superduper"
cask "synology-drive"
cask "tailscale-app"
cask "todoist-app"
cask "transmission"
cask "transnomino"
cask "vanilla"
cask "visual-studio-code"
cask "vlc"
cask "vox"
cask "warp"
cask "webpquicklook"
cask "xld"
cask "zed"
cask "zen"
cask "zoom"
mas "Clear Clipboard", id: 870330316
mas "Home Assistant", id: 1099568401
mas "iA Writer", id: 775737590
mas "Moom Classic", id: 419330170
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onedark"
vscode "antfu.goto-alias"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "ecmel.vscode-html-css"
vscode "emeraldwalk.runonsave"
vscode "fabianlauer.vs-code-xml-format"
vscode "folke.vscode-monorepo-workspace"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "henoc.svgeditor"
vscode "jkjustjoshing.vscode-text-pastry"
vscode "jvalecillos.gpg"
vscode "kevinrose.vsc-python-indent"
vscode "kilocode.kilo-code"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "misbahansori.svg-fold"
vscode "mohsen1.prettify-json"
vscode "ms-ceintl.vscode-language-pack-fr"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "narasimapandiyan.jetbrainsmono"
vscode "naumovs.color-highlight"
vscode "nuxt.mdc"
vscode "nuxtr.nuxt-vscode-extentions"
vscode "nuxtr.nuxtr-vscode"
vscode "oderwat.indent-rainbow"
vscode "oxc.oxc-vscode"
vscode "patbenatar.advanced-new-file"
vscode "pkief.material-icon-theme"
vscode "qezhu.gitlink"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sourcegraph.amp"
vscode "sst-dev.opencode"
vscode "tamasfe.even-better-toml"
vscode "vstirbu.vscode-mermaid-preview"
vscode "vue.volar"
vscode "vunguyentuan.vscode-postcss"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
go "github.com/cloudflare/cfssl/cmd/cfssl"
go "github.com/cloudflare/cfssl/cmd/cfssl-bundle"
go "github.com/cloudflare/cfssl/cmd/cfssl-certinfo"
go "github.com/cloudflare/cfssl/cmd/cfssl-newkey"
go "github.com/cloudflare/cfssl/cmd/cfssl-scan"
go "github.com/cloudflare/cfssl/cmd/cfssljson"
go "github.com/sammcj/gollama"
go "golang.org/x/tools/gopls"
go "github.com/cloudflare/cfssl/cmd/mkbundle"
go "github.com/cloudflare/cfssl/cmd/multirootca"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "update-bin"
