adpyke.codesnap
akamud.vscode-theme-onedark
antfu.goto-alias
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
biomejs.biome
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
charliermarsh.ruff
christian-kohler.path-intellisense
codezombiech.gitignore
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dotjoshjohnson.xml
ecmel.vscode-html-css
emeraldwalk.runonsave
fabianlauer.vs-code-xml-format
folke.vscode-monorepo-workspace
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
foxundermoon.shell-format
github.copilot
github.copilot-chat
github.vscode-pull-request-github
gruntfuggly.todo-tree
henoc.svgeditor
jkjustjoshing.vscode-text-pastry
jvalecillos.gpg
kevinrose.vsc-python-indent
kilocode.kilo-code
mechatroner.rainbow-csv
mermaidchart.vscode-mermaid-chart
misbahansori.svg-fold
mohsen1.prettify-json
ms-ceintl.vscode-language-pack-fr
ms-python.autopep8
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
narasimapandiyan.jetbrainsmono
naumovs.color-highlight
nuxt.mdc
nuxtr.nuxt-vscode-extentions
nuxtr.nuxtr-vscode
oderwat.indent-rainbow
oxc.oxc-vscode
patbenatar.advanced-new-file
pkief.material-icon-theme
qezhu.gitlink
quicktype.quicktype
redhat.vscode-yaml
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
sourcegraph.amp
sst-dev.opencode
tamasfe.even-better-toml
vstirbu.vscode-mermaid-preview
vue.volar
vunguyentuan.vscode-postcss
yzhang.markdown-all-in-one
zainchen.json
